SemScan-API/soap_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <validateUserWithDetails xmlns="http://tempuri.org/">
      <uname>benariet@bgu.ac.il</uname>
      <pwd>talmaster1</pwd>
      <id></id>
      <department>1</department>
    </validateUserWithDetails>
  </soap:Body>
</soap:Envelope>
